## **EDA**  exploratory data analysis

**FASE 1**

In [33]:
import pandas as pd

#### ENTENDER LOS DATOS

In [34]:
df = pd.read_csv("hr_raw_data.csv", index_col = 0)

df.head(2)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,...,20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,...,33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1

In [35]:
print(f"El número de filas que tenemos es {df.shape[0]}, y el número de columnas es {df.shape[1]}")

El número de filas que tenemos es 1678, y el número de columnas es 41

In [36]:
# TIPOS DE DATOS

df.dtypes

age                          object
attrition                    object
businesstravel               object
dailyrate                   float64
department                   object
distancefromhome              int64
education                     int64
educationfield               object
employeecount                 int64
employeenumber                int64
environmentsatisfaction       int64
gender                        int64
hourlyrate                  float64
jobinvolvement                int64
joblevel                      int64
jobrole                      object
jobsatisfaction               int64
maritalstatus                object
monthlyincome                object
monthlyrate                  object
numcompaniesworked            int64
over18                       object
overtime                     object
percentsalaryhike             int64
performancerating            object
relationshipsatisfaction      int64
standardhours                object
stockoptionlevel              int64
totalworkingyears            object
trainingtimeslastyear         int64
worklifebalance              object
yearsatcompany                int64
yearsincurrentrole           object
yearssincelastpromotion       int64
yearswithcurrmanager          int64
sameasmonthlyincome          object
datebirth                     int64
salary                       object
roledepartament              object
numberchildren              float64
remotework                   object
dtype: object

In [37]:
# PORCENTAJE DE NULOS

round(df.isnull().sum()/df.shape[0]*100, 2)

age                           0.00
attrition                     0.00
businesstravel               47.74
dailyrate                     0.00
department                   81.41
distancefromhome              0.00
education                     0.00
educationfield               46.13
employeecount                 0.00
employeenumber                0.00
environmentsatisfaction       0.00
gender                        0.00
hourlyrate                   75.51
jobinvolvement                0.00
joblevel                      0.00
jobrole                       0.00
jobsatisfaction               0.00
maritalstatus                40.23
monthlyincome                29.14
monthlyrate                   0.00
numcompaniesworked            0.00
over18                       55.90
overtime                     41.48
percentsalaryhike             0.00
performancerating            11.92
relationshipsatisfaction      0.00
standardhours                20.92
stockoptionlevel              0.00
totalworkingyears            32.72
trainingtimeslastyear         0.00
worklifebalance               6.79
yearsatcompany                0.00
yearsincurrentrole           97.91
yearssincelastpromotion       0.00
yearswithcurrmanager          0.00
sameasmonthlyincome          29.14
datebirth                     0.00
salary                       16.98
roledepartament              81.41
numberchildren              100.00
remotework                    0.00
dtype: float64

In [38]:
df['businesstravel'].value_counts()

businesstravel
travel_rarely        616
travel_frequently    168
non-travel            93
Name: count, dtype: int64

In [39]:
# ENTENDER LA RELACIÓN Y DIFERENCIAS ENTRE ESTAS COLUMNAS

df[['jobrole', 'dailyrate', 'monthlyincome', 'monthlyrate', 'salary']]

,jobrole,dailyrate,monthlyincome,monthlyrate,salary
0,resEArch DIREcToR,2015.722222,"16280,83$","42330,17$","195370,00$"
1,ManAGeR,2063.388889,NaN,"43331,17$","199990,00$"
2,ManaGER,1984.253968,NaN,"41669,33$","192320,00$"
3,ReseArCH DIrECtOr,1771.404762,"14307,50$","37199,50$","171690,00$"
4,sAleS EXECUtIve,1582.771346,"12783,92$","33238,20$",NaN
...,...,...,...,...,...
1673,rESEaRcH SciEnTiST,488.944444,"3949,17$","10267,83$",NaN
1674,mANager,1973.984127,"15943,72$","41453,67$","191324,62$"
1675,reSearch sCienTiSt,290.035510,NaN,"6090,75$","28111,13$"
1676,maNufACTURING DIREctOr,1032.487286,"8339,32$","21682,23$","100071,84$"
1677,resEArch scIENTisT,556.256661,NaN,"11681,39$","53914,11$"

In [40]:
df['department'].value_counts()

department
Research & Development     203
Sales                       93
Human Resources             16
Name: count, dtype: int64

In [41]:
df[['distancefromhome']].value_counts()

distancefromhome
 2                  228
 1                  209
 9                   89
 10                  86
 8                   85
                   ...
-34                   2
-43                   2
-49                   2
-39                   1
-40                   1
Name: count, Length: 69, dtype: int64

In [42]:
df['education'].value_counts()

education
3    649
4    461
2    322
1    186
5     60
Name: count, dtype: int64

In [43]:
df['educationfield'].value_counts()

educationfield
Life Sciences       367
Medical             286
Marketing           106
Technical Degree     70
Other                63
Human Resources      12
Name: count, dtype: int64

In [44]:
df['employeecount'].value_counts()

employeecount
1    1678
Name: count, dtype: int64

In [45]:
df['employeenumber'].duplicated().sum()

np.int64(64)

In [46]:
df['environmentsatisfaction'].unique()

array([ 1,  3,  4,  2, 42, 37, 35, 25, 27, 31, 39, 21, 15, 14, 33, 19, 12,
       13, 28, 47, 36, 29, 24, 46, 16, 22, 41, 49, 11, 48, 18, 10, 45, 38,
       17, 20, 26, 43])

In [47]:
df['relationshipsatisfaction'].value_counts()

relationshipsatisfaction
3    527
4    483
2    350
1    318
Name: count, dtype: int64

In [48]:
df["relationshipsatisfaction"].mean()

np.float64(2.700238379022646)

In [49]:
df['standardhours'].value_counts()

standardhours
Part Time    927
Full Time    400
Name: count, dtype: int64

In [50]:
df['stockoptionlevel'].value_counts()

stockoptionlevel
0    719
1    689
2    177
3     93
Name: count, dtype: int64

**stock options**
- son incentivos que permiten a los empleados comprar acciones de la empresa a un precio fijo (generalmente más bajo que el de mercado) después de cierto tiempo o cumpliendo ciertos objetivos.

- es un indicador de cuánto puede beneficiarse un empleado de las stock options dentro de la empresa.



    0 → No tiene asignadas stock options.

    1 → Nivel básico, pocas opciones asignadas.

    2 → Nivel intermedio, más opciones que el nivel 1.

    3 → Nivel alto, la mayor cantidad de opciones asignadas, normalmente para puestos clave o ejecutivos.

En otras palabras, a mayor número, mayor beneficio potencial de las stock options.

In [51]:
df['yearswithcurrmanager'].value_counts()

yearswithcurrmanager
2     395
0     285
7     275
3     152
8     122
4     108
1      87
9      71
5      39
10     33
6      31
11     22
12     20
13     17
17      8
15      5
14      5
16      3
Name: count, dtype: int64

In [52]:
df['remotework'].unique()

array(['Yes', '1', 'False', '0', 'True'], dtype=object)